
# tap repositories and their packages

tap "datawire/blackbird"
brew "telepresence"

tap "git@github.com:wantedly/homebrew-tools"

tap "heroku/brew"
brew "heroku"
brew "heroku/brew/heroku-node"

tap "nodenv/nodenv"
brew "node-build-update-defs"

tap "wagoodman/dive"
brew "dive"

tap "wantedly/tools"
brew "rid"
brew "valec"
brew "valecjr"

tap "wantedly/tools"

# Other Homebrew packages
brew "ag"
brew "brew-file"
brew "colordiff"
brew "curl"
brew "direnv"
brew "envchain"
brew "exa"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "ghq"
brew "gibo"
brew "git"
brew "go"
brew "htop"
brew "jq"
brew "lua"
brew "neovim"
brew "node"
brew "node-build"
brew "nodenv"
brew "npm"
brew "openssl"
brew "pandoc"
brew "pandoc-crossref"
brew "peco"
brew "perl"
brew "postgresql"
brew "protobuf"
brew "python"
brew "rbenv"
brew "readline"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "ruby-build"
brew "sqlite"
brew "sshfs"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"

# Other Cask applications
cask "alfred"
cask "bettertouchtool"
cask "cyberduck"
cask "dash"
cask "docker"
cask "firefox"
cask "google-japanese-ime"
cask "insomnia"
cask "osxfuse"
cask "postgres"
cask "sketch"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zeplin"
